DeviceName = "Built-in Audio";
DeviceShortName = "Built-in";
ManufacturerName = "Apple Computer, Inc.";

Headphones = "Headphones";
IntSpeakers  = "Internal Speakers";
LineOut = "Line Out";
DigitalOut = "Digital Out";

InternalMic = "Internal microphone";
LineIn = "Line In";
DigitalIn = "Digital In";

DeviceNameHeadphone = "Built-in Audio Headphone";
DeviceNameSpeaker = "Built-in Audio Speaker";
DeviceNameLineOut = "Built-in Audio Line Output";
DeviceNameDigitalOut = "Built-in Audio Digital Output";
DeviceNameLineIn = "Built-in Audio Line Input";
DeviceNameAuxIn = "Built-in Audio Auxilliary Input";
DeviceNameMic = "Built-in Audio Microphone";
DeviceNameDigitalIn = "Built-in Audio Digital Input";

DevShortNameHdpn = "Built-in Headphone";
DevShortNameSpkr = "Built-in Speaker";
DevShortNameLino = "Built-in Line Output";
DevShortNameSpdo = "Built-in Digital Output";
DevShortNameOut = "Built-in Output";
DevShortNameLini = "Built-in Line Input";
DevShortNameAuxi = "Built-in Aux Input";
DevShortNameIMic = "Built-in Microphone";
DevShortNameSpdi = "Built-in Digital Input";
DevShortNameIn = "Built-in Input";

UnlockedClock = "Unlocked";
LockedClock = "Locked";